In [33]:
from sqlalchemy import create_engine, Table, Column, MetaData, Integer, Computed
from random import randint
import os
from dotenv import load_dotenv
import pandas as pd

# dialect+driver = 'postgres' for us, host probably = 'localhost' (for now), username defaults to 'postgres'

In [34]:
load_dotenv()
username=os.environ.get('DB_USERNAME')
password=os.environ.get('DB_PASSWORD')
print(username)
print(password)

postgres
RiceLake.390

In [35]:
print('Connecting to DB...\n')
connection = create_engine('postgresql+psycopg2://postgres:RiceLake.390@localhost:5432/EmployeeDB').connect()

Connecting to DB...

In [36]:
def doQuery(query): # READ
    return connection.execute(query).fetchall()
def doUpdate(updateQuery): # CREATE, UPDATE, DELETE
    connection.execute(updateQuery)
query = "select e.emp_no, e.emp_title_id, e.birthdate, e.first_name, e.last_name, e.sex, e.hire_date, t.title, s.salary \
from employee e, salary s, title t \
where e.emp_no = s.emp_no and \
e.emp_title_id = t.title_id"

queryResults = doQuery(query)
queryResults_df = pd.DataFrame(queryResults)
# for row in queryResults:
#     print(row)
# print('queryResults:', queryResults, type(queryResults))
print('\nClosing connection')
connection.close()
queryResults_df = queryResults_df.rename(columns={0:'Emp Number', 1:'Title ID', 2:'Birth Date',3:'First Name',4:'Last Name',5:'Gender',6:'Hire Date',7:'Title',8:'Salary'})
queryResults_df.head()

Closing connection

,Employee Number,Employee Title,Birth Date,First Name,Last Name,Gender,Hire Date,Title,Salary
0,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,Staff,87084
1,67799,e0002,1961-10-17,Pantung,Cools,M,1994-01-28,Engineer,48111
2,299898,s0001,1964-02-15,Munehiko,Janocha,M,1988-12-11,Staff,63315
3,492723,e0003,1959-09-30,Piyawadee,Sanella,M,1987-07-11,Senior Engineer,46740
4,411614,e0003,1958-03-29,Martins,Wynblatt,M,1992-02-15,Senior Engineer,54770